app/views/works/_list.html.erb

      <tr>
        <td><%= work.votes.count %></td>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."work_id" = $1  [["work_id", 907060870]]