app/views/works/show.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."work_id" = $1  [["work_id", 838179347]]
---
                <section class="works-votes__container">
                  <h3 class="works-votes__header"><%= @work.votes.count %> votes for this <%= @work.category %></h3>