app/views/users/show.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."user_id" = $1  [["user_id", 530365487]]
---
      <tbody>
      <% if @user.votes.any? %>