app/controllers/homepages_controller.rb

SELECT "works".* FROM "works"
SELECT "works".* FROM "works" WHERE "works"."category" = $1  [["category", "movie"]]
---
  def index
     @work = Work.all
     @movies = @work.where(category: "movie")