app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    puts "this is bogus!"
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Gillian Chung"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Gillian Chung"], ["created_at", "2020-10-29 22:56:03.043147"], ["updated_at", "2020-10-29 22:56:03.043147"]]
---
  def login
    username = params[:user][:username]
    user = User.find_by(username: username)

    if user
      session[:user_id] = user.id
      flash[:success] = "Successfully logged in as existing user #{username}"
      redirect_to homepages_path
      return
    else
      user = User.new(username: username)
      if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 530365493], ["LIMIT", 1]]
---
  def logout
    if session[:user_id]
      user = User.find_by(id: session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 530365487], ["LIMIT", 1]]
---
  def find_user
    user_id = params[:id].to_i
    @user = User.find_by(id: user_id)