app/controllers/votes_controller.rb

  def upvote
    if params[:work_id]
      @work = Work.find_by(id: params[:work_id])

      if session[:user_id]
        @user = User.find_by(id: session[:user_id])

        @vote = Vote.new(work: @work, user: @user)

        if @vote.save
---
SELECT "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 334884854], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 530365489], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "work_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 530365489], ["work_id", 334884854], ["created_at", "2020-10-29 22:56:03.064682"], ["updated_at", "2020-10-29 22:56:03.064682"]]