app/controllers/works_controller.rb

  def show
    @work = Work.find_by(id: params[:id])
---
SELECT "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 838179347], ["LIMIT", 1]]

  def create
    @work = Work.new(work_params)

    if @work.save
---
INSERT INTO "works" ("category", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category", "movie"], ["title", "Modern Family Movie"], ["created_at", "2020-10-29 22:56:03.307804"], ["updated_at", "2020-10-29 22:56:03.307804"]]

  def edit
    @work = Work.find_by(id: params[:id])
---
SELECT "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 838179347], ["LIMIT", 1]]

  def update
    @work = Work.find_by(id: params[:id])
    if @work.nil?
      render :file => "#{Rails.root}/public/404.html",  layout: false, status: :not_found
      return
    elsif @work.update(work_params)
---
SELECT "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 929075732], ["LIMIT", 1]]
UPDATE "works" SET "title" = $1, "category" = $2, "creator" = $3, "publication_year" = $4, "updated_at" = $5 WHERE "works"."id" = $6  [["title", "Harry Potter 5"], ["category", "book"], ["creator", "JK Rowling"], ["publication_year", 2000], ["updated_at", "2020-10-29 22:55:49.126443"], ["id", 929075732]]

  def destroy
    @work = Work.find_by(id: params[:id])

    if @work.nil?
      render :file => "#{Rails.root}/public/404.html",  layout: false, status: :not_found
      return
    end

    @work.destroy
---
SELECT "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 321130596], ["LIMIT", 1]]
DELETE FROM "works" WHERE "works"."id" = $1  [["id", 321130596]]